In [1]:
%matplotlib notebook
import pandas as pd

In [2]:
fileWhite = "Resources/White_Not_Hispanic.csv"
fileLatino = "Resources/Hispanic_or_Latino.csv"
fileBlack = "Resources/Black_or_African_American.csv"
fileAsian = "Resources/Asian_Alone.csv"
fileHousePrices = "Resources/Metro_Zhvi_AllHomes.csv"

white_df = pd.read_csv(fileWhite)
latino_df = pd.read_csv(fileLatino)
black_df = pd.read_csv(fileBlack)
asian_df = pd.read_csv(fileAsian)
house_price_df = pd.read_csv(fileHousePrices, encoding="ISO-8859-1")

In [3]:
white_df.head()

,GEO.id,GEO.id2,GEO.display-label,HD01_VD01,HD02_VD01,HD01_VD02,HD02_VD02,HD01_VD03,HD02_VD03,HD01_VD04,...,HD01_VD27,HD02_VD27,HD01_VD28,HD02_VD28,HD01_VD29,HD02_VD29,HD01_VD30,HD02_VD30,HD01_VD31,HD02_VD31
0,Id,Id2,Geography,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
1,1600000US0107000,0107000,"Birmingham city, Alabama",47715,4950,24522,2624,992,598,499,...,1838,678,2692,666,2289,699,1729,512,705,344
2,1600000US0121184,0121184,"Dothan city, Alabama",40791,1297,19202,750,1033,226,1320,...,2285,389,3104,394,2744,285,1425,223,884,287
3,1600000US0135896,0135896,"Hoover city, Alabama",62480,3243,30250,2203,1739,637,2086,...,4167,1118,5406,1148,4393,1008,2259,604,1077,471
4,1600000US0137000,0137000,"Huntsville city, Alabama",112586,4383,55295,2765,2653,983,2674,...,7876,1205,9242,1009,6960,824,4139,708,2158,592

In [4]:
new_header = white_df.iloc[0]
white_df = white_df[1:]
white_df.columns = new_header

new_header = latino_df.iloc[0]
latino_df = latino_df[1:]
latino_df.columns = new_header

new_header = black_df.iloc[0]
black_df = black_df[1:]
black_df.columns = new_header

new_header = asian_df.iloc[0]
asian_df = asian_df[1:]
asian_df.columns = new_header
asian_df.head()

,Id,Id2,Geography,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
1,1600000US0203000,0203000,"Anchorage municipality, Alaska",31646,2025,14506,1085,1117,254,1302,...,2367,251,1808,94,1101,94,553,338,312,309
2,1600000US0412000,0412000,"Chandler city, Arizona",25208,3542,11155,1673,666,350,1205,...,2007,566,1151,495,1146,466,415,292,0,208
3,1600000US0427400,0427400,"Gilbert town, Arizona",12125,2670,6041,1503,303,245,387,...,1014,419,1088,545,107,130,45,77,68,112
4,1600000US0427820,0427820,"Glendale city, Arizona",11402,2861,5386,1585,174,180,171,...,1649,587,535,249,862,417,175,219,268,300
5,1600000US0446000,0446000,"Mesa city, Arizona",10121,1979,4027,878,100,117,123,...,866,374,620,302,449,265,281,229,0,208

In [5]:
white_df = white_df.set_index("Geography")
latino_df = latino_df.set_index("Geography")
black_df = black_df.set_index("Geography")
asian_df = asian_df.set_index("Geography")

In [6]:
white_df.head()

,Id,Id2,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,Margin of Error; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
Geography,,,,,,,,,,,,,,,,,,,,,
"Birmingham city, Alabama",1600000US0107000,0107000,47715,4950,24522,2624,992,598,499,339,...,1838,678,2692,666,2289,699,1729,512,705,344
"Dothan city, Alabama",1600000US0121184,0121184,40791,1297,19202,750,1033,226,1320,291,...,2285,389,3104,394,2744,285,1425,223,884,287
"Hoover city, Alabama",1600000US0135896,0135896,62480,3243,30250,2203,1739,637,2086,720,...,4167,1118,5406,1148,4393,1008,2259,604,1077,471
"Huntsville city, Alabama",1600000US0137000,0137000,112586,4383,55295,2765,2653,983,2674,748,...,7876,1205,9242,1009,6960,824,4139,708,2158,592
"Mobile city, Alabama",1600000US0150000,0150000,77861,4258,38221,2669,2092,768,1546,626,...,5421,1050,5713,994,4835,795,2960,698,1569,557

In [7]:
white_select_df = pd.DataFrame(white_df.loc[[
    "New York city, New York", 
    "Los Angeles city, California", 
    "Chicago city, Illinois", 
    "Seattle city, Washington", 
    "Cleveland city, Ohio", 
    "Philadelphia city, Pennsylvania", 
    "Miami Beach city, Florida", 
    "Atlanta city, Georgia", 
    "Dallas city, Texas", 
    "Phoenix city, Arizona"]])
white_select_df

,Id,Id2,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,Margin of Error; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
Geography,,,,,,,,,,,,,,,,,,,,,
"New York city, New York",1600000US3651000,3651000,2733369,3491,1335056,1995,77496,320,61005,3557,...,155131,746,168236,669,149703,212,91398,3725,54893,3787
"Los Angeles city, California",1600000US0644000,0644000,1124411,16581,570031,9878,23184,1998,21048,2483,...,73359,3538,77529,2599,61406,2478,32822,2571,22951,2660
"Chicago city, Illinois",1600000US1714000,1714000,893334,13447,443560,7257,22268,1983,14976,1980,...,50338,2836,53361,2723,37613,2188,21911,2499,12069,1557
"Seattle city, Washington",1600000US5363000,5363000,464010,9052,232605,5189,10040,1498,8765,1380,...,30332,2354,28413,2312,21315,1824,8448,1329,6389,1284
"Cleveland city, Ohio",1600000US3916000,3916000,126714,5455,62754,3421,1764,611,1897,660,...,9318,1405,9735,1244,7252,914,4298,933,2254,618
"Philadelphia city, Pennsylvania",1600000US4260000,4260000,545580,709,265463,304,13482,109,9706,1309,...,30228,100,36685,329,29288,179,17646,1366,9952,1366
"Miami Beach city, Florida",1600000US1245025,1245025,36303,3334,19583,2274,1943,768,1233,714,...,2985,730,1427,429,995,424,1161,656,540,338
"Atlanta city, Georgia",1600000US1304000,1304000,179296,7208,93152,4963,3447,808,3586,965,...,9976,1470,7051,1053,6118,949,2300,650,2366,827
"Dallas city, Texas",1600000US4819000,4819000,381559,10124,185177,5681,10556,1136,7782,1210,...,19789,2137,27216,1965,20519,1699,12192,1381,7495,1230
"Phoenix city, Arizona",1600000US0455000,0455000,679477,15081,337397,8725,16413,1687,15289,2145,...,48594,2723,54592,2873,39251,2709,18660,1815,11185,1721

In [8]:
latino_select_df = pd.DataFrame(latino_df.loc[[
    "New York city, New York", 
    "Los Angeles city, California", 
    "Chicago city, Illinois", 
    "Seattle city, Washington", 
    "Cleveland city, Ohio", 
    "Philadelphia city, Pennsylvania", 
    "Miami Beach city, Florida", 
    "Atlanta city, Georgia", 
    "Dallas city, Texas", 
    "Phoenix city, Arizona"]])
latino_select_df

,Id,Id2,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,Margin of Error; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
Geography,,,,,,,,,,,,,,,,,,,,,
"New York city, New York",1600000US3651000,3651000,2517429,*****,1220704,*****,97553,*****,82915,4343,...,165825,*****,139066,*****,92097,443,50088,2119,21968,2219
"Los Angeles city, California",1600000US0644000,0644000,1956978,21980,981419,13775,71182,3678,77203,3851,...,124855,4309,92839,3768,48920,2829,22373,1828,12730,1775
"Chicago city, Illinois",1600000US1714000,1714000,787978,15520,398590,9527,30104,2299,31244,3101,...,43791,2277,33971,1788,20839,1293,10408,1077,2198,619
"Seattle city, Washington",1600000US5363000,5363000,48209,6459,22689,3603,1704,850,1050,648,...,3010,872,1486,712,1128,463,377,299,153,151
"Cleveland city, Ohio",1600000US3916000,3916000,47962,3344,23824,1736,2201,420,2774,738,...,2674,545,1964,380,940,297,793,160,98,100
"Philadelphia city, Pennsylvania",1600000US4260000,4260000,234183,*****,116390,*****,12316,*****,11086,1431,...,12831,*****,9197,*****,5116,*****,2057,606,947,606
"Miami Beach city, Florida",1600000US1245025,1245025,50493,3701,25625,2852,1761,976,465,435,...,3306,1009,3295,1124,2334,792,1571,648,1924,919
"Atlanta city, Georgia",1600000US1304000,1304000,20878,3308,11407,2370,1177,563,1284,815,...,963,504,329,270,157,169,279,299,0,224
"Dallas city, Texas",1600000US4819000,4819000,561455,14508,288334,8529,26571,2735,26516,2784,...,29158,1840,18969,1674,9765,1155,3695,887,1647,790
"Phoenix city, Arizona",1600000US0455000,0455000,697746,15107,349357,9407,32385,2622,30923,2561,...,38475,2343,23624,1794,10600,1235,4325,856,1790,766

In [9]:
black_select_df = pd.DataFrame(black_df.loc[[
    "New York city, New York", 
    "Los Angeles city, California", 
    "Chicago city, Illinois", 
    "Seattle city, Washington", 
    "Cleveland city, Ohio", 
    "Philadelphia city, Pennsylvania", 
    "Fort Lauderdale city, Florida", 
    "Atlanta city, Georgia", 
    "Dallas city, Texas", 
    "Phoenix city, Arizona"]])
black_select_df

,Id,Id2,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,Margin of Error; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
Geography,,,,,,,,,,,,,,,,,,,,,
"New York city, New York",1600000US3651000,3651000,2094132,18240,955905,9992,68608,2443,59729,3423,...,159387,2378,150634,2240,100390,1804,56615,2623,25707,2389
"Los Angeles city, California",1600000US0644000,0644000,362079,12120,171866,7330,8943,1969,6990,1569,...,27151,2168,27003,1825,18165,1614,9673,1524,5408,1075
"Chicago city, Illinois",1600000US1714000,1714000,809079,13927,364869,8005,26267,2161,23517,2309,...,55863,2630,60501,2639,40781,1788,24967,1881,9144,1364
"Seattle city, Washington",1600000US5363000,5363000,49980,6201,25185,3304,1368,856,2615,1088,...,3298,955,3658,891,1877,719,723,479,469,305
"Cleveland city, Ohio",1600000US3916000,3916000,187759,5798,84594,3766,7369,1024,6797,1356,...,11580,1446,14407,1177,7685,927,4740,693,2745,582
"Philadelphia city, Pennsylvania",1600000US4260000,4260000,663708,7721,301825,4375,23043,982,22420,2063,...,45642,1233,46283,351,29961,837,16540,1605,7698,1582
"Fort Lauderdale city, Florida",1600000US1224000,1224000,59911,7114,27576,3814,2885,1161,2163,1004,...,3382,1062,3374,929,1919,763,1217,577,443,313
"Atlanta city, Georgia",1600000US1304000,1304000,256888,8197,118097,4967,7535,1984,9913,1957,...,16121,1737,16113,2004,10504,1615,6862,1045,2251,838
"Dallas city, Texas",1600000US4819000,4819000,328114,11889,151417,6562,13176,1813,10811,1749,...,21339,2187,21792,1810,12903,1520,6945,971,2295,706
"Phoenix city, Arizona",1600000US0455000,0455000,117767,8005,60634,4619,5785,1275,4084,1253,...,5747,1301,5918,937,3011,725,1111,462,651,404

In [10]:
asian_select_df = pd.DataFrame(asian_df.loc[[
    "New York city, New York", 
    "Los Angeles city, California", 
    "Chicago city, Illinois", 
    "Seattle city, Washington", 
    "Cleveland city, Ohio", 
    "Philadelphia city, Pennsylvania", 
    "Pembroke Pines city, Florida", 
    "Atlanta city, Georgia", 
    "Dallas city, Texas", 
    "Phoenix city, Arizona"]])
asian_select_df

,Id,Id2,Estimate; Total:,Margin of Error; Total:,Estimate; Male:,Margin of Error; Male:,Estimate; Male: - Under 5 years,Margin of Error; Male: - Under 5 years,Estimate; Male: - 5 to 9 years,Margin of Error; Male: - 5 to 9 years,...,Estimate; Female: - 45 to 54 years,Margin of Error; Female: - 45 to 54 years,Estimate; Female: - 55 to 64 years,Margin of Error; Female: - 55 to 64 years,Estimate; Female: - 65 to 74 years,Margin of Error; Female: - 65 to 74 years,Estimate; Female: - 75 to 84 years,Margin of Error; Female: - 75 to 84 years,Estimate; Female: - 85 years and over,Margin of Error; Female: - 85 years and over
Geography,,,,,,,,,,,,,,,,,,,,,
"New York city, New York",1600000US3651000,3651000,1252589,10827,592778,5809,35733,1546,31354,1849,...,91773,1534,81701,1008,50382,984,27396,1507,9797,1542
"Los Angeles city, California",1600000US0644000,0644000,461936,15188,215744,8613,9202,1790,8541,1145,...,33418,2166,34379,2311,25144,2134,15616,1872,7468,1172
"Chicago city, Illinois",1600000US1714000,1714000,181505,9190,86897,4415,4691,1052,3287,870,...,11658,1275,9757,1287,7510,1202,3263,809,2153,806
"Seattle city, Washington",1600000US5363000,5363000,114680,7890,54703,4183,1521,694,2168,936,...,7105,1271,5772,1087,4492,975,2340,736,1081,639
"Cleveland city, Ohio",1600000US3916000,3916000,9319,1979,4930,1114,50,83,216,217,...,581,288,752,316,524,286,110,175,166,181
"Philadelphia city, Pennsylvania",1600000US4260000,4260000,115279,2837,53257,1757,2890,385,2494,933,...,7603,286,6687,131,3975,84,2026,318,438,318
"Pembroke Pines city, Florida",1600000US1255775,1255775,10827,3132,5026,1655,303,298,375,362,...,902,583,915,588,391,388,621,470,72,121
"Atlanta city, Georgia",1600000US1304000,1304000,19551,2945,10424,1874,233,264,321,311,...,1038,670,497,322,108,133,42,91,0,224
"Dallas city, Texas",1600000US4819000,4819000,49720,4831,26221,3213,1269,719,830,451,...,2382,701,1988,677,1324,508,933,489,208,171
"Phoenix city, Arizona",1600000US0455000,0455000,65216,6300,31420,3898,1968,672,1931,701,...,3869,912,3521,644,1752,595,1343,504,178,157

In [11]:
white_demographics_df = pd.DataFrame(white_select_df["Estimate; Total:"])
white_demographics_df = white_demographics_df.rename(
    columns = {"Estimate; Total:": "White Total"})
white_demographics_df = white_demographics_df.rename(
    index={
        "Miami Beach city, Florida": "Miami city, Florida"})

white_demographics_df

                                White Total
Geography
New York city, New York             2733369
Los Angeles city, California        1124411
Chicago city, Illinois               893334
Seattle city, Washington             464010
Cleveland city, Ohio                 126714
Philadelphia city, Pennsylvania      545580
Miami city, Florida                   36303
Atlanta city, Georgia                179296
Dallas city, Texas                   381559
Phoenix city, Arizona                679477

In [12]:
latino_demographics_df = pd.DataFrame(latino_select_df["Estimate; Total:"])

latino_demographics_df = latino_demographics_df.rename(
    columns = {"Estimate; Total:": "Hispanic/Latino Total"})

latino_demographics_df = latino_demographics_df.rename(
    index={
        "Miami Beach city, Florida": "Miami city, Florida"})

latino_demographics_df

                                Hispanic/Latino Total
Geography
New York city, New York                       2517429
Los Angeles city, California                  1956978
Chicago city, Illinois                         787978
Seattle city, Washington                        48209
Cleveland city, Ohio                            47962
Philadelphia city, Pennsylvania                234183
Miami city, Florida                             50493
Atlanta city, Georgia                           20878
Dallas city, Texas                             561455
Phoenix city, Arizona                          697746

In [13]:
black_demographics_df = pd.DataFrame(black_select_df["Estimate; Total:"])

black_demographics_df = black_demographics_df.rename(
    columns = {"Estimate; Total:": "Black/African American Total"})

black_demographics_df = black_demographics_df.rename(
    index={
        "Fort Lauderdale city, Florida": "Miami city, Florida"})

black_demographics_df

                                Black/African American Total
Geography
New York city, New York                              2094132
Los Angeles city, California                          362079
Chicago city, Illinois                                809079
Seattle city, Washington                               49980
Cleveland city, Ohio                                  187759
Philadelphia city, Pennsylvania                       663708
Miami city, Florida                                    59911
Atlanta city, Georgia                                 256888
Dallas city, Texas                                    328114
Phoenix city, Arizona                                 117767

In [14]:
asian_demographics_df = pd.DataFrame(asian_select_df["Estimate; Total:"])

asian_demographics_df = asian_demographics_df.rename(
    columns = {"Estimate; Total:": "Asian Total"})

asian_demographics_df = asian_demographics_df.rename(
    index={
        "Pembroke Pines city, Florida": "Miami city, Florida"})

asian_demographics_df

                                Asian Total
Geography
New York city, New York             1252589
Los Angeles city, California         461936
Chicago city, Illinois               181505
Seattle city, Washington             114680
Cleveland city, Ohio                   9319
Philadelphia city, Pennsylvania      115279
Miami city, Florida                   10827
Atlanta city, Georgia                 19551
Dallas city, Texas                    49720
Phoenix city, Arizona                 65216

In [15]:
house_price_df = house_price_df.set_index("RegionName")

In [16]:
house_price_select_df = pd.DataFrame(house_price_df.loc[[
    "New York, NY", 
    "Los Angeles-Long Beach-Anaheim, CA", 
    "Chicago, IL", 
    "Seattle, WA", 
    "Cleveland, OH", 
    "Philadelphia, PA", 
    "Miami-Fort Lauderdale, FL", 
    "Atlanta, GA", 
    "Dallas-Fort Worth, TX", 
    "Phoenix, AZ"]])
house_price_select_df

,RegionID,SizeRank,1996-04,1996-05,1996-06,1996-07,1996-08,1996-09,1996-10,1996-11,...,2018-05,2018-06,2018-07,2018-08,2018-09,2018-10,2018-11,2018-12,2019-01,2019-02
RegionName,,,,,,,,,,,,,,,,,,,,,
"New York, NY",394913,1,164400.0,164400.0,164300.0,164100.0,164000.0,163900.0,163800.0,163900.0,...,426500,427700,428800,429600,431100,433500,435800,437300,438900,440400
"Los Angeles-Long Beach-Anaheim, CA",753899,2,170300.0,170100.0,169900.0,169700.0,169600.0,169400.0,169300.0,169300.0,...,642700,644300,646000,647800,648700,649900,651400,652500,652700,652200
"Chicago, IL",394463,3,138300.0,138900.0,139300.0,139400.0,139300.0,138800.0,138000.0,137000.0,...,220300,220800,220800,221000,221700,222300,223000,223900,224800,225300
"Seattle, WA",395078,15,154800.0,154700.0,154800.0,155100.0,155400.0,155900.0,156400.0,157200.0,...,485200,487800,487500,486600,487200,488000,488300,489700,491500,491500
"Cleveland, OH",394475,29,101000.0,101500.0,102100.0,102800.0,103300.0,103800.0,104300.0,104700.0,...,140200,140900,141300,141900,142800,143700,144500,145200,145900,146300
"Philadelphia, PA",394974,5,109600.0,109600.0,109600.0,109500.0,109400.0,109300.0,109300.0,109400.0,...,227000,227700,228300,228900,229600,230400,231200,232000,232800,233500
"Miami-Fort Lauderdale, FL",394856,8,94800.0,94900.0,95000.0,95000.0,95000.0,95100.0,95100.0,95200.0,...,271700,273900,275700,277200,278600,280000,281200,282500,283900,284700
"Atlanta, GA",394347,9,102500.0,103100.0,103900.0,104700.0,105500.0,106300.0,107000.0,107600.0,...,202900,204700,206100,207600,209500,212200,214900,216600,217800,218600
"Dallas-Fort Worth, TX",394514,4,115300.0,115400.0,115500.0,115700.0,115900.0,116100.0,116400.0,116600.0,...,228300,230300,232000,232900,234100,236100,238400,240700,243000,244400
"Phoenix, AZ",394976,14,105500.0,106000.0,106500.0,107000.0,107500.0,108000.0,108500.0,109000.0,...,253000,254900,256600,257800,259100,261000,262500,263900,265400,266300

In [17]:
housing_prices_select_2017_df = pd.DataFrame(
    house_price_select_df[["2017-01", 
                              "2017-02", 
                              "2017-03", 
                              "2017-04", 
                              "2017-05", 
                              "2017-06", 
                              "2017-07", 
                              "2017-08", 
                              "2017-09", 
                              "2017-10", 
                              "2017-11", 
                              "2017-12"]])

housing_prices_select_2017_df

,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09,2017-10,2017-11,2017-12
RegionName,,,,,,,,,,,,
"New York, NY",390000,391300,393300,396500,400200,403800,406700,408600,410400,412500,414200,415600
"Los Angeles-Long Beach-Anaheim, CA",588400,591500,594200,596600,599400,602800,606400,610500,614600,618600,622400,626300
"Chicago, IL",203600,204500,205600,206800,208000,208700,209500,210400,211300,212200,213400,214400
"Seattle, WA",418700,423900,428900,434100,439700,444500,448100,451000,453600,456800,460600,465200
"Cleveland, OH",128100,128700,129300,130100,131100,131900,132600,133300,134100,134800,135500,136200
"Philadelphia, PA",209900,210900,212000,213200,214700,216000,217200,218400,219500,220700,222100,223700
"Miami-Fort Lauderdale, FL",246300,248000,249200,250600,252100,253500,255000,256500,258100,259700,260800,261800
"Atlanta, GA",178300,179500,180700,181800,183000,184000,184700,185700,187200,188500,189700,191300
"Dallas-Fort Worth, TX",197100,198800,200700,202600,204500,206000,207500,209300,211100,212600,214200,216100
"Phoenix, AZ",229700,230100,231700,233800,235200,236500,238000,239600,241200,242600,243600,244800

In [18]:
house_2017_to_sum_df = housing_prices_select_2017_df[["2017-01", 
                                                      "2017-02", 
                                                      "2017-03", 
                                                      "2017-04", 
                                                      "2017-05", 
                                                      "2017-06", 
                                                      "2017-07", 
                                                      "2017-08", 
                                                      "2017-09", 
                                                      "2017-10", 
                                                      "2017-11", 
                                                      "2017-12"]]
house_2017_to_sum_df
housing_prices_select_2017_df["Average House Prices, 2017"] = house_2017_to_sum_df.mean(axis=1)
housing_prices_select_2017_df = housing_prices_select_2017_df.reset_index()
housing_2017_df = housing_prices_select_2017_df[["RegionName", "Average House Prices, 2017"]]
housing_2017_df = housing_2017_df.rename(columns={"RegionName": "City"})
housing_2017_df = housing_2017_df.set_index("City")
housing_2017_df = pd.DataFrame(housing_2017_df["Average House Prices, 2017"].astype("int"))
housing_2017_df = housing_2017_df.rename({
    "Los Angeles-Long Beach-Anaheim, CA": "Los Angeles, CA",
    "Miami-Fort Lauderdale, FL":"Miami, FL",
    "Dallas-Fort Worth, TX":"Dallas, TX"})
housing_2017_df

                  Average House Prices, 2017
City
New York, NY                          403591
Los Angeles, CA                       605975
Chicago, IL                           209033
Seattle, WA                           443758
Cleveland, OH                         132141
Philadelphia, PA                      216525
Miami, FL                             254300
Atlanta, GA                           184533
Dallas, TX                            206708
Phoenix, AZ                           237233

In [19]:
race_demographics_df = pd.merge(white_demographics_df, 
                            latino_demographics_df, 
                           how="inner", 
                           on="Geography")

race_demographics_df = pd.merge(race_demographics_df,  
                            black_demographics_df, 
                           how="inner", 
                           on="Geography")

race_demographics_df = pd.merge(race_demographics_df,
                            asian_demographics_df, 
                           how="inner", 
                           on="Geography")

race_demographics_df = race_demographics_df.rename({
    "New York city, New York": "New York, NY", 
    "Los Angeles city, California": "Los Angeles, CA",
    "Chicago city, Illinois": "Chicago, IL",
    "Seattle city, Washington": "Seattle, WA",
    "Cleveland city, Ohio": "Cleveland, OH",
    "Philadelphia city, Pennsylvania": "Philadelphia, PA",
    "Miami city, Florida": "Miami, FL",
    "Dallas city, Texas": "Dallas, TX",
    "Phoenix city, Arizona": "Phoenix, AZ",
    "Atlanta city, Georgia": "Atlanta, GA"})

race_demographics_df = race_demographics_df.reset_index()
race_demographics_df = race_demographics_df.rename(columns= {"Geography": "City"})
race_demographics_df = race_demographics_df.set_index("City")

race_demographics_df = pd.merge(race_demographics_df,  
                            housing_2017_df, 
                           how="inner", 
                           on="City")

race_demographics_df

,White Total,Hispanic/Latino Total,Black/African American Total,Asian Total,"Average House Prices, 2017"
City,,,,,
"New York, NY",2733369,2517429,2094132,1252589,403591
"Los Angeles, CA",1124411,1956978,362079,461936,605975
"Chicago, IL",893334,787978,809079,181505,209033
"Seattle, WA",464010,48209,49980,114680,443758
"Cleveland, OH",126714,47962,187759,9319,132141
"Philadelphia, PA",545580,234183,663708,115279,216525
"Miami, FL",36303,50493,59911,10827,254300
"Atlanta, GA",179296,20878,256888,19551,184533
"Dallas, TX",381559,561455,328114,49720,206708
"Phoenix, AZ",679477,697746,117767,65216,237233

In [20]:
age_demographics_df_pt1 = pd.merge(white_select_df, 
                            latino_select_df, 
                            how="inner", 
                            on="Geography", 
                            suffixes=('_white', '_latino'))

age_demographics_df_pt2 = pd.merge(black_select_df,
                            asian_select_df,
                            how="inner", 
                            on="Geography",
                            suffixes=('_black', '_asian'))

age_demographics_select_df = pd.merge(age_demographics_df_pt1,
                            age_demographics_df_pt2,
                            how="inner", 
                            on="Geography")

age_demographics_select_df = age_demographics_select_df.rename({
    "New York city, New York": "New York, NY", 
    "Los Angeles city, California": "Los Angeles, CA",
    "Chicago city, Illinois": "Chicago, IL",
    "Seattle city, Washington": "Seattle, WA",
    "Cleveland city, Ohio": "Cleveland, OH",
    "Philadelphia city, Pennsylvania": "Philadelphia, PA",
    "Miami city, Florida": "Miami, FL",
    "Dallas city, Texas": "Dallas, TX",
    "Phoenix city, Arizona": "Phoenix, AZ",
    "Atlanta city, Georgia": "Atlanta, GA"})

age_demographics_select_df = age_demographics_select_df.reset_index()
age_demographics_select_df = age_demographics_select_df.rename(columns= {"Geography": "City"})
age_demographics_select_df = age_demographics_select_df.set_index("City")

age_demographics_select_df = pd.merge(age_demographics_select_df,  
                            housing_2017_df, 
                           how="inner", 
                           on="City")

age_demographics_select_df

,Id_white,Id2_white,Estimate; Total:_white,Margin of Error; Total:_white,Estimate; Male:_white,Margin of Error; Male:_white,Estimate; Male: - Under 5 years_white,Margin of Error; Male: - Under 5 years_white,Estimate; Male: - 5 to 9 years_white,Margin of Error; Male: - 5 to 9 years_white,...,Margin of Error; Female: - 45 to 54 years_asian,Estimate; Female: - 55 to 64 years_asian,Margin of Error; Female: - 55 to 64 years_asian,Estimate; Female: - 65 to 74 years_asian,Margin of Error; Female: - 65 to 74 years_asian,Estimate; Female: - 75 to 84 years_asian,Margin of Error; Female: - 75 to 84 years_asian,Estimate; Female: - 85 years and over_asian,Margin of Error; Female: - 85 years and over_asian,"Average House Prices, 2017"
City,,,,,,,,,,,,,,,,,,,,,
"New York, NY",1600000US3651000,3651000,2733369,3491,1335056,1995,77496,320,61005,3557,...,1534,81701,1008,50382,984,27396,1507,9797,1542,403591
"Los Angeles, CA",1600000US0644000,0644000,1124411,16581,570031,9878,23184,1998,21048,2483,...,2166,34379,2311,25144,2134,15616,1872,7468,1172,605975
"Chicago, IL",1600000US1714000,1714000,893334,13447,443560,7257,22268,1983,14976,1980,...,1275,9757,1287,7510,1202,3263,809,2153,806,209033
"Seattle, WA",1600000US5363000,5363000,464010,9052,232605,5189,10040,1498,8765,1380,...,1271,5772,1087,4492,975,2340,736,1081,639,443758
"Cleveland, OH",1600000US3916000,3916000,126714,5455,62754,3421,1764,611,1897,660,...,288,752,316,524,286,110,175,166,181,132141
"Philadelphia, PA",1600000US4260000,4260000,545580,709,265463,304,13482,109,9706,1309,...,286,6687,131,3975,84,2026,318,438,318,216525
"Atlanta, GA",1600000US1304000,1304000,179296,7208,93152,4963,3447,808,3586,965,...,670,497,322,108,133,42,91,0,224,184533
"Dallas, TX",1600000US4819000,4819000,381559,10124,185177,5681,10556,1136,7782,1210,...,701,1988,677,1324,508,933,489,208,171,206708
"Phoenix, AZ",1600000US0455000,0455000,679477,15081,337397,8725,16413,1687,15289,2145,...,912,3521,644,1752,595,1343,504,178,157,237233

In [21]:
list(age_demographics_select_df.columns)

['Id_white',
 'Id2_white',
 'Estimate; Total:_white',
 'Margin of Error; Total:_white',
 'Estimate; Male:_white',
 'Margin of Error; Male:_white',
 'Estimate; Male: - Under 5 years_white',
 'Margin of Error; Male: - Under 5 years_white',
 'Estimate; Male: - 5 to 9 years_white',
 'Margin of Error; Male: - 5 to 9 years_white',
 'Estimate; Male: - 10 to 14 years_white',
 'Margin of Error; Male: - 10 to 14 years_white',
 'Estimate; Male: - 15 to 17 years_white',
 'Margin of Error; Male: - 15 to 17 years_white',
 'Estimate; Male: - 18 and 19 years_white',
 'Margin of Error; Male: - 18 and 19 years_white',
 'Estimate; Male: - 20 to 24 years_white',
 'Margin of Error; Male: - 20 to 24 years_white',
 'Estimate; Male: - 25 to 29 years_white',
 'Margin of Error; Male: - 25 to 29 years_white',
 'Estimate; Male: - 30 to 34 years_white',
 'Margin of Error; Male: - 30 to 34 years_white',
 'Estimate; Male: - 35 to 44 years_white',
 'Margin of Error; Male: - 35 to 44 years_white',
 'Estimate; Male: - 45 to 54 years_white',
 'Margin of Error; Male: - 45 to 54 years_white',
 'Estimate; Male: - 55 to 64 years_white',
 'Margin of Error; Male: - 55 to 64 years_white',
 'Estimate; Male: - 65 to 74 years_white',
 'Margin of Error; Male: - 65 to 74 years_white',
 'Estimate; Male: - 75 to 84 years_white',
 'Margin of Error; Male: - 75 to 84 years_white',
 'Estimate; Male: - 85 years and over_white',
 'Margin of Error; Male: - 85 years and over_white',
 'Estimate; Female:_white',
 'Margin of Error; Female:_white',
 'Estimate; Female: - Under 5 years_white',
 'Margin of Error; Female: - Under 5 years_white',
 'Estimate; Female: - 5 to 9 years_white',
 'Margin of Error; Female: - 5 to 9 years_white',
 'Estimate; Female: - 10 to 14 years_white',
 'Margin of Error; Female: - 10 to 14 years_white',
 'Estimate; Female: - 15 to 17 years_white',
 'Margin of Error; Female: - 15 to 17 years_white',
 'Estimate; Female: - 18 and 19 years_white',
 'Margin of Error; Female: - 18 and 19 years_white',
 'Estimate; Female: - 20 to 24 years_white',
 'Margin of Error; Female: - 20 to 24 years_white',
 'Estimate; Female: - 25 to 29 years_white',
 'Margin of Error; Female: - 25 to 29 years_white',
 'Estimate; Female: - 30 to 34 years_white',
 'Margin of Error; Female: - 30 to 34 years_white',
 'Estimate; Female: - 35 to 44 years_white',
 'Margin of Error; Female: - 35 to 44 years_white',
 'Estimate; Female: - 45 to 54 years_white',
 'Margin of Error; Female: - 45 to 54 years_white',
 'Estimate; Female: - 55 to 64 years_white',
 'Margin of Error; Female: - 55 to 64 years_white',
 'Estimate; Female: - 65 to 74 years_white',
 'Margin of Error; Female: - 65 to 74 years_white',
 'Estimate; Female: - 75 to 84 years_white',
 'Margin of Error; Female: - 75 to 84 years_white',
 'Estimate; Female: - 85 years and over_white',
 'Margin of Error; Female: - 85 years and over_white',
 'Id_latino',
 'Id2_latino',
 'Estimate; Total:_latino',
 'Margin of Error; Total:_latino',
 'Estimate; Male:_latino',
 'Margin of Error; Male:_latino',
 'Estimate; Male: - Under 5 years_latino',
 'Margin of Error; Male: - Under 5 years_latino',
 'Estimate; Male: - 5 to 9 years_latino',
 'Margin of Error; Male: - 5 to 9 years_latino',
 'Estimate; Male: - 10 to 14 years_latino',
 'Margin of Error; Male: - 10 to 14 years_latino',
 'Estimate; Male: - 15 to 17 years_latino',
 'Margin of Error; Male: - 15 to 17 years_latino',
 'Estimate; Male: - 18 and 19 years_latino',
 'Margin of Error; Male: - 18 and 19 years_latino',
 'Estimate; Male: - 20 to 24 years_latino',
 'Margin of Error; Male: - 20 to 24 years_latino',
 'Estimate; Male: - 25 to 29 years_latino',
 'Margin of Error; Male: - 25 to 29 years_latino',
 'Estimate; Male: - 30 to 34 years_latino',
 'Margin of Error; Male: - 30 to 34 years_latino',
 'Estimate; Male: - 35 to 44 years_latino',
 'Margin of Error; Male: - 35 to 44 years_latino',
 'Estimate; Male: - 45 to 54 years_latino',
 'Margin of Error; Male: - 45 to 54 years_latino',
 'Estimate; Male: - 55 to 64 years_latino',
 'Margin of Error; Male: - 55 to 64 years_latino',
 'Estimate; Male: - 65 to 74 years_latino',
 'Margin of Error; Male: - 65 to 74 years_latino',
 'Estimate; Male: - 75 to 84 years_latino',
 'Margin of Error; Male: - 75 to 84 years_latino',
 'Estimate; Male: - 85 years and over_latino',
 'Margin of Error; Male: - 85 years and over_latino',
 'Estimate; Female:_latino',
 'Margin of Error; Female:_latino',
 'Estimate; Female: - Under 5 years_latino',
 'Margin of Error; Female: - Under 5 years_latino',
 'Estimate; Female: - 5 to 9 years_latino',
 'Margin of Error; Female: - 5 to 9 years_latino',
 'Estimate; Female: - 10 to 14 years_latino',
 'Margin of Error; Female: - 10 to 14 years_latino',
 'Estimate; Female: - 15 to 17 years_latino',
 'Margin of Error; Female: - 15 to 17 years_latino',
 'Estimate; Female: - 18 and 19 years_latino',
 'Margin of Error; Female: - 18 and 19 years_latino',
 'Estimate; Female: - 20 to 24 years_latino',
 'Margin of Error; Female: - 20 to 24 years_latino',
 'Estimate; Female: - 25 to 29 years_latino',
 'Margin of Error; Female: - 25 to 29 years_latino',
 'Estimate; Female: - 30 to 34 years_latino',
 'Margin of Error; Female: - 30 to 34 years_latino',
 'Estimate; Female: - 35 to 44 years_latino',
 'Margin of Error; Female: - 35 to 44 years_latino',
 'Estimate; Female: - 45 to 54 years_latino',
 'Margin of Error; Female: - 45 to 54 years_latino',
 'Estimate; Female: - 55 to 64 years_latino',
 'Margin of Error; Female: - 55 to 64 years_latino',
 'Estimate; Female: - 65 to 74 years_latino',
 'Margin of Error; Female: - 65 to 74 years_latino',
 'Estimate; Female: - 75 to 84 years_latino',
 'Margin of Error; Female: - 75 to 84 years_latino',
 'Estimate; Female: - 85 years and over_latino',
 'Margin of Error; Female: - 85 years and over_latino',
 'Id_black',
 'Id2_black',
 'Estimate; Total:_black',
 'Margin of Error; Total:_black',
 'Estimate; Male:_black',
 'Margin of Error; Male:_black',
 'Estimate; Male: - Under 5 years_black',
 'Margin of Error; Male: - Under 5 years_black',
 'Estimate; Male: - 5 to 9 years_black',
 'Margin of Error; Male: - 5 to 9 years_black',
 'Estimate; Male: - 10 to 14 years_black',
 'Margin of Error; Male: - 10 to 14 years_black',
 'Estimate; Male: - 15 to 17 years_black',
 'Margin of Error; Male: - 15 to 17 years_black',
 'Estimate; Male: - 18 and 19 years_black',
 'Margin of Error; Male: - 18 and 19 years_black',
 'Estimate; Male: - 20 to 24 years_black',
 'Margin of Error; Male: - 20 to 24 years_black',
 'Estimate; Male: - 25 to 29 years_black',
 'Margin of Error; Male: - 25 to 29 years_black',
 'Estimate; Male: - 30 to 34 years_black',
 'Margin of Error; Male: - 30 to 34 years_black',
 'Estimate; Male: - 35 to 44 years_black',
 'Margin of Error; Male: - 35 to 44 years_black',
 'Estimate; Male: - 45 to 54 years_black',
 'Margin of Error; Male: - 45 to 54 years_black',
 'Estimate; Male: - 55 to 64 years_black',
 'Margin of Error; Male: - 55 to 64 years_black',
 'Estimate; Male: - 65 to 74 years_black',
 'Margin of Error; Male: - 65 to 74 years_black',
 'Estimate; Male: - 75 to 84 years_black',
 'Margin of Error; Male: - 75 to 84 years_black',
 'Estimate; Male: - 85 years and over_black',
 'Margin of Error; Male: - 85 years and over_black',
 'Estimate; Female:_black',
 'Margin of Error; Female:_black',
 'Estimate; Female: - Under 5 years_black',
 'Margin of Error; Female: - Under 5 years_black',
 'Estimate; Female: - 5 to 9 years_black',
 'Margin of Error; Female: - 5 to 9 years_black',
 'Estimate; Female: - 10 to 14 years_black',
 'Margin of Error; Female: - 10 to 14 years_black',
 'Estimate; Female: - 15 to 17 years_black',
 'Margin of Error; Female: - 15 to 17 years_black',
 'Estimate; Female: - 18 and 19 years_black',
 'Margin of Error; Female: - 18 and 19 years_black',
 'Estimate; Female: - 20 to 24 years_black',
 'Margin of Error; Female: - 20 to 24 years_black',
 'Estimate; Female: - 25 to 29 years_black',
 'Margin of Error; Female: - 25 to 29 years_black',
 'Estimate; Female: - 30 to 34 years_black',
 'Margin of Error; Female: - 30 to 34 years_black',
 'Estimate; Female: - 35 to 44 years_black',
 'Margin of Error; Female: - 35 to 44 years_black',
 'Estimate; Female: - 45 to 54 years_black',
 'Margin of Error; Female: - 45 to 54 years_black',
 'Estimate; Female: - 55 to 64 years_black',
 'Margin of Error; Female: - 55 to 64 years_black',
 'Estimate; Female: - 65 to 74 years_black',
 'Margin of Error; Female: - 65 to 74 years_black',
 'Estimate; Female: - 75 to 84 years_black',
 'Margin of Error; Female: - 75 to 84 years_black',
 'Estimate; Female: - 85 years and over_black',
 'Margin of Error; Female: - 85 years and over_black',
 'Id_asian',
 'Id2_asian',
 'Estimate; Total:_asian',
 'Margin of Error; Total:_asian',
 'Estimate; Male:_asian',
 'Margin of Error; Male:_asian',
 'Estimate; Male: - Under 5 years_asian',
 'Margin of Error; Male: - Under 5 years_asian',
 'Estimate; Male: - 5 to 9 years_asian',
 'Margin of Error; Male: - 5 to 9 years_asian',
 'Estimate; Male: - 10 to 14 years_asian',
 'Margin of Error; Male: - 10 to 14 years_asian',
 'Estimate; Male: - 15 to 17 years_asian',
 'Margin of Error; Male: - 15 to 17 years_asian',
 'Estimate; Male: - 18 and 19 years_asian',
 'Margin of Error; Male: - 18 and 19 years_asian',
 'Estimate; Male: - 20 to 24 years_asian',
 'Margin of Error; Male: - 20 to 24 years_asian',
 'Estimate; Male: - 25 to 29 years_asian',
 'Margin of Error; Male: - 25 to 29 years_asian',
 'Estimate; Male: - 30 to 34 years_asian',
 'Margin of Error; Male: - 30 to 34 years_asian',
 'Estimate; Male: - 35 to 44 years_asian',
 'Margin of Error; Male: - 35 to 44 years_asian',
 'Estimate; Male: - 45 to 54 years_asian',
 'Margin of Error; Male: - 45 to 54 years_asian',
 'Estimate; Male: - 55 to 64 years_asian',
 'Margin of Error; Male: - 55 to 64 years_asian',
 'Estimate; Male: - 65 to 74 years_asian',
 'Margin of Error; Male: - 65 to 74 years_asian',
 'Estimate; Male: - 75 to 84 years_asian',
 'Margin of Error; Male: - 75 to 84 years_asian',
 'Estimate; Male: - 85 years and over_asian',
 'Margin of Error; Male: - 85 years and over_asian',
 'Estimate; Female:_asian',
 'Margin of Error; Female:_asian',
 'Estimate; Female: - Under 5 years_asian',
 'Margin of Error; Female: - Under 5 years_asian',
 'Estimate; Female: - 5 to 9 years_asian',
 'Margin of Error; Female: - 5 to 9 years_asian',
 'Estimate; Female: - 10 to 14 years_asian',
 'Margin of Error; Female: - 10 to 14 years_asian',
 'Estimate; Female: - 15 to 17 years_asian',
 'Margin of Error; Female: - 15 to 17 years_asian',
 'Estimate; Female: - 18 and 19 years_asian',
 'Margin of Error; Female: - 18 and 19 years_asian',
 'Estimate; Female: - 20 to 24 years_asian',
 'Margin of Error; Female: - 20 to 24 years_asian',
 'Estimate; Female: - 25 to 29 years_asian',
 'Margin of Error; Female: - 25 to 29 years_asian',
 'Estimate; Female: - 30 to 34 years_asian',
 'Margin of Error; Female: - 30 to 34 years_asian',
 'Estimate; Female: - 35 to 44 years_asian',
 'Margin of Error; Female: - 35 to 44 years_asian',
 'Estimate; Female: - 45 to 54 years_asian',
 'Margin of Error; Female: - 45 to 54 years_asian',
 'Estimate; Female: - 55 to 64 years_asian',
 'Margin of Error; Female: - 55 to 64 years_asian',
 'Estimate; Female: - 65 to 74 years_asian',
 'Margin of Error; Female: - 65 to 74 years_asian',
 'Estimate; Female: - 75 to 84 years_asian',
 'Margin of Error; Female: - 75 to 84 years_asian',
 'Estimate; Female: - 85 years and over_asian',
 'Margin of Error; Female: - 85 years and over_asian',
 'Average House Prices, 2017']

In [29]:
age_to_sum_df = age_demographics_select_df[["Estimate; Male: - Under 5 years_white", 
                                            "Estimate; Female: - Under 5 years_white", 
                                            "Estimate; Male: - Under 5 years_latino", 
                                            "Estimate; Female: - Under 5 years_latino", 
                                            "Estimate; Male: - Under 5 years_black", 
                                            "Estimate; Female: - Under 5 years_black", 
                                            "Estimate; Male: - Under 5 years_asian", 
                                            "Estimate; Female: - Under 5 years_asian"]]

age_to_sum_df["Under 5 Years Old"] = age_to_sum_df.sum(axis=1)
age_to_sum_df

C:\Users\kentj\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

,Estimate; Male: - Under 5 years_white,Estimate; Female: - Under 5 years_white,Estimate; Male: - Under 5 years_latino,Estimate; Female: - Under 5 years_latino,Estimate; Male: - Under 5 years_black,Estimate; Female: - Under 5 years_black,Estimate; Male: - Under 5 years_asian,Estimate; Female: - Under 5 years_asian,Under 5 Years Old
City,,,,,,,,,
"New York, NY",77496,73466,97553,93555,68608,65109,35733,32850,7.749673e+39
"Los Angeles, CA",23184,21391,71182,69039,8943,6144,9202,8725,2.318421e+35
"Chicago, IL",22268,20989,30104,31105,26267,27255,4691,4574,2.226821e+37
"Seattle, WA",10040,11275,1704,2053,1368,2264,1521,2280,1.004011e+33
"Cleveland, OH",1764,2167,2201,1874,7369,7321,50,379,1.764217e+28
"Philadelphia, PA",13482,13053,12316,11771,23043,24180,2890,3250,1.348213e+37
"Atlanta, GA",3447,4322,1177,878,7535,7924,233,160,3.447432e+28
"Dallas, TX",10556,10195,26571,25039,13176,13305,1269,1373,1.055610e+37
"Phoenix, AZ",16413,14093,32385,34981,5785,5460,1968,2080,1.641314e+35